import React from "react";
import "./Main.scss";
import mainImage from "../../assets/images/main.png";

const Main = () => {
  return (
    <section className="main">
      <div className="container">
        <div className="main-info">
          <div className="main-info-title">
            Привет! я{" "}
            <span className="span-name">
              Дмитрий Якшенков.
              <br />
            </span>{" "}
            <span className="span-frontend">Frontend</span>{" "}
            <span className="span-developer">Developer</span> из <br />
            <span className="span-spb">Санкт-Петербурга.</span>
          </div>
          <div className="main-info-desc">
            Я Дмитрий Якшенков, начинающий Frontend-разработчик. Специализируюсь
            на создании пользовательских интерфейсов с использованием Angular,
            React, JavaScript и TypeScript. В настоящее время активно расширяю
            свои знания через создание пет-проектов и изучении разработки, а так
            же с помощью фриланса. Ищу возможность присоединиться к команде, где
            смогу применять свои навыки и расти как профессионал.
          </div>
          <div className="main-info-links">
            <div className="github link-icon">
              <a href="">
                <svg
                role="img"
                viewBox="0 0 24 24"
                xmlns="http://www.w3.org/2000/svg"
              >
                <title>GitHub</title>
                <path d="M12 .297c-6.63 0-12 5.373-12 12 0 5.303 3.438 9.8 8.205 11.385.6.113.82-.258.82-.577 0-.285-.01-1.04-.015-2.04-3.338.724-4.042-1.61-4.042-1.61C4.422 18.07 3.633 17.7 3.633 17.7c-1.087-.744.084-.729.084-.729 1.205.084 1.838 1.236 1.838 1.236 1.07 1.835 2.809 1.305 3.495.998.108-.776.417-1.305.76-1.605-2.665-.3-5.466-1.332-5.466-5.93 0-1.31.465-2.38 1.235-3.22-.135-.303-.54-1.523.105-3.176 0 0 1.005-.322 3.3 1.23.96-.267 1.98-.399 3-.405 1.02.006 2.04.138 3 .405 2.28-1.552 3.285-1.23 3.285-1.23.645 1.653.24 2.873.12 3.176.765.84 1.23 1.91 1.23 3.22 0 4.61-2.805 5.625-5.475 5.92.42.36.81 1.096.81 2.22 0 1.606-.015 2.896-.015 3.286 0 .315.21.69.825.57C20.565 22.092 24 17.592 24 12.297c0-6.627-5.373-12-12-12" />
              </svg>
              </a>
            </div>
            <div className="discord link-icon">
              <a href="">
                <svg
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M8.24006 8.38998C7.67006 8.38998 7.22006 8.88998 7.22006 9.49998C7.22006 10.11 7.68006 10.61 8.24006 10.61C8.81006 10.61 9.26006 10.11 9.26006 9.49998C9.27006 8.88998 8.81006 8.38998 8.24006 8.38998ZM11.8901 8.38998C11.3201 8.38998 10.8701 8.88998 10.8701 9.49998C10.8701 10.11 11.3301 10.61 11.8901 10.61C12.4601 10.61 12.9101 10.11 12.9101 9.49998C12.9101 8.88998 12.4601 8.38998 11.8901 8.38998Z"
                  fill="black"
                />
                <path
                  d="M16.75 0H3.35005C2.22005 0 1.30005 0.92 1.30005 2.06V15.58C1.30005 16.72 2.22005 17.64 3.35005 17.64H14.69L14.16 15.79L15.44 16.98L16.65 18.1L18.8 20V2.06C18.8 0.92 17.88 0 16.75 0ZM12.89 13.06C12.89 13.06 12.53 12.63 12.23 12.25C13.54 11.88 14.04 11.06 14.04 11.06C13.63 11.33 13.24 11.52 12.89 11.65C12.39 11.86 11.91 12 11.44 12.08C10.48 12.26 9.60005 12.21 8.85005 12.07C8.28005 11.96 7.79005 11.8 7.38005 11.64C7.15005 11.55 6.90005 11.44 6.65005 11.3C6.62005 11.28 6.59005 11.27 6.56005 11.25C6.54005 11.24 6.53005 11.23 6.52005 11.22C6.34005 11.12 6.24005 11.05 6.24005 11.05C6.24005 11.05 6.72005 11.85 7.99005 12.23C7.69005 12.61 7.32005 13.06 7.32005 13.06C5.11005 12.99 4.27005 11.54 4.27005 11.54C4.27005 8.32 5.71005 5.71 5.71005 5.71C7.15005 4.63 8.52005 4.66 8.52005 4.66L8.62005 4.78C6.82005 5.3 5.99005 6.09 5.99005 6.09C5.99005 6.09 6.21005 5.97 6.58005 5.8C7.65005 5.33 8.50005 5.2 8.85005 5.17C8.91005 5.16 8.96005 5.15 9.02005 5.15C9.63005 5.07 10.32 5.05 11.04 5.13C11.99 5.24 13.01 5.52 14.05 6.09C14.05 6.09 13.26 5.34 11.5601 4.82L11.7 4.66C11.7 4.66 13.07 4.63 14.51 5.71C14.51 5.71 15.95 8.32 15.95 11.54C15.95 11.54 15.1 12.99 12.89 13.06Z"
                  fill="black"
                />
              </svg>
              </a>
            </div>
          </div>
        </div>
        <div className="main-image">
          <img src={mainImage} alt="" />
        </div>
      </div>
    </section>
  );
};

export default Main;
